# Diameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoutingCondition..::..Diameter Property
RoutingCondition Class See Also
---
The diameter of the segment or fitting specified for the routing condition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Diameter { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Diameter As Double
	Get
```

Visual C++
---
```text
public:
property double Diameter {
	double get ();
}
```

# See Also
RoutingCondition Class
Autodesk.Revit.DB Namespace